src/main/resources/reports/stage2/get_results/wrk/wrk_get_3_smart_no_sync.txt
Running 10s test @ http://localhost:8080
  1 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.26ms   10.18ms 134.78ms   96.70%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43ms
 75.000%    2.00ms
 90.000%    2.98ms
 99.000%   58.81ms
 99.900%  112.51ms
 99.990%  126.97ms
 99.999%  133.89ms
100.000%  134.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.107     0.000000            1         1.00
       0.681     0.100000         9976         1.11
       0.894     0.200000        19965         1.25
       1.078     0.300000        29900         1.43
       1.252     0.400000        39859         1.67
       1.426     0.500000        49831         2.00
       1.516     0.550000        54801         2.22
       1.612     0.600000        59774         2.50
       1.723     0.650000        64749         2.86
       1.846     0.700000        69733         3.33
       1.998     0.750000        74724         4.00
       2.095     0.775000        77224         4.44
       2.205     0.800000        79730         5.00
       2.333     0.825000        82190         5.71
       2.497     0.850000        84665         6.67
       2.695     0.875000        87155         8.00
       2.823     0.887500        88413         8.89
       2.981     0.900000        89651        10.00
       3.197     0.912500        90888        11.43
       3.497     0.925000        92130        13.33
       4.013     0.937500        93376        16.00
       4.527     0.943750        94000        17.78
       5.259     0.950000        94619        20.00
       6.279     0.956250        95241        22.86
       8.255     0.962500        95865        26.67
      17.551     0.968750        96487        32.00
      24.335     0.971875        96797        35.56
      30.479     0.975000        97109        40.00
      35.711     0.978125        97421        45.71
      41.439     0.981250        97731        53.33
      46.687     0.984375        98043        64.00
      49.247     0.985938        98199        71.11
      52.287     0.987500        98355        80.00
      55.743     0.989062        98509        91.43
      61.055     0.990625        98665       106.67
      68.415     0.992188        98823       128.00
      71.743     0.992969        98898       142.22
      75.647     0.993750        98977       160.00
      79.039     0.994531        99054       182.86
      84.607     0.995313        99132       213.33
      90.303     0.996094        99209       256.00
      92.479     0.996484        99248       284.44
      95.999     0.996875        99287       320.00
      98.879     0.997266        99326       365.71
     102.399     0.997656        99365       426.67
     105.727     0.998047        99405       512.00
     106.751     0.998242        99423       568.89
     108.415     0.998437        99444       640.00
     109.759     0.998633        99462       731.43
     110.847     0.998828        99482       853.33
     112.703     0.999023        99503      1024.00
     113.599     0.999121        99511      1137.78
     114.623     0.999219        99523      1280.00
     115.647     0.999316        99532      1462.86
     116.735     0.999414        99540      1706.67
     118.207     0.999512        99551      2048.00
     119.167     0.999561        99555      2275.56
     119.999     0.999609        99560      2560.00
     120.895     0.999658        99564      2925.71
     122.047     0.999707        99569      3413.33
     123.007     0.999756        99575      4096.00
     123.903     0.999780        99578      4551.11
     124.223     0.999805        99579      5120.00
     124.863     0.999829        99582      5851.43
     125.247     0.999854        99584      6826.67
     125.951     0.999878        99586      8192.00
     126.975     0.999890        99588      9102.22
     127.807     0.999902        99589     10240.00
     128.063     0.999915        99590     11702.86
     128.831     0.999927        99591     13653.33
     129.215     0.999939        99592     16384.00
     129.791     0.999945        99593     18204.44
     130.303     0.999951        99594     20480.00
     130.303     0.999957        99594     23405.71
     131.455     0.999963        99595     27306.67
     131.455     0.999969        99595     32768.00
     132.735     0.999973        99596     36408.89
     132.735     0.999976        99596     40960.00
     132.735     0.999979        99596     46811.43
     133.887     0.999982        99597     54613.33
     133.887     0.999985        99597     65536.00
     133.887     0.999986        99597     72817.78
     133.887     0.999988        99597     81920.00
     133.887     0.999989        99597     93622.86
     134.911     0.999991        99598    109226.67
     134.911     1.000000        99598          inf
#[Mean    =        3.257, StdDeviation   =       10.184]
#[Max     =      134.784, Total count    =        99598]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99601 requests in 10.00s, 285.12MB read
  Non-2xx or 3xx responses: 28281
Requests/sec:   9959.98
Transfer/sec:     28.51MB